import dish from '../images/plov.jpg';

export default function Dish() {
    return (
        <div className="card">
            <div className="card-image waves-effect waves-block waves-light">
                <img className="activator" src={dish} />
            </div>
            <div className="card-content">
                <span className="card-title activator grey-text text-darken-4">Плов<i className="material-icons right">more_vert</i></span>
            </div>
            <div className="card-reveal">
                <span className="card-title grey-text text-darken-4"><b>Плов</b><i className="material-icons right">close</i></span>
                <p><b>Інгридієнти:</b><br />
                    Свинина (або курка) 600гр.<br />
                    Рис 1,5 склянки.<br />
                    Морква 1 шт.<br />
                    Цибуля ріпчаста 2 шт.<br />
                    Олія 30 г.<br />
                    Сіль за смаком.<br />
                    Перець за смаком.<br />
                    Цукор.<br />
                    Приправа для плову.<br />
                </p>
                <p><b>Як приготувати плов:</b><br />
                    1. Свинину вимити, обсушити.<br />
                    2. М'ясо розрізати на порційні шматочки, розміром 2х2 см. Розігріти пательню, налити олію. Викласти м'ясо. Смажити на середньому вогні до золотистої скоринки, перевертаючи шматочки (хвилин 10-15).<br />
                    3. Очистити і помити моркву. Моркву натерти на крупній тертці або нарізати тонкою соломкою. Очистити, помити цибулю, нарізати дрібно кубиками або тонкими півкільцями. Підготовлене м'ясо викласти в казанок. У сковороду в гарячу олію викласти моркву і цибулю. Тушкувати, помішуючи, на середньому вогні 2-3 хвилини. До м'яса в казанок викласти зажарку.<br />
                    4. Закип'ятити чайник. М'ясо з овочами в казанку перемішати. Посолити, поперчити, додати улюблені спеції, цукор. Перемішати. Залити окропом. Довести до кипіння.<br />
                    5. Рис викласти на м'ясо. Якщо є необхідність, додати окропу. Рис повинен покриватися водою на 2 пальці. Накрити кришкою, зменшити вогонь до мінімального. Варити плов зі свинини до готовності рису, 40-45 хвилин.</p>
            </div>
        </div>
    );
}